#coding: utf-8
puts "========================================"
puts "сколько часов в году?"
puts 'часов в году => '
puts (24*365)
puts 'часов'
puts "----------------------------------------"
puts "сколько минут в десятилетии?"
mInDay=60*24
mInYear=mInDay*365
mIn10Years=mInYear*10
puts mIn10Years
puts "----------------------------------------"
puts "Мой возраст в секундах?"
puts "мне 33 года"
puts "в секундах это ->"
secInHour=60*60
secInDay=secInHour*24
secInYear=secInDay*365
puts secInYear*33
puts "----------------------------------------"
puts "прожив 943 миллиона секунд вы прожили "
puts ((((943000000/60)/60)/24)/365)
puts "========================================"

