#coding: utf-8
puts 'Привет, мир!'
puts ""
puts "До свидания."
puts "================================"
puts "Я сам определяю чем я буду заниматься и куда я пойду"
puts "================================"
puts "я люблю " + "яблочный пирог."
puts "================================"
puts "миг "*4
puts "================================"
puts 12+12
puts '12'+'12'
puts '12+12'
puts "================================"
puts 2*5
puts '2'*5
puts '2*5'
puts "================================"
#puts '12'+12
#puts '2'*'5'
puts "================================"
puts '\'Ты шикарная!\''
puts 'обратная черта в конце строки: \\'
puts 'вверх\\вниз'
puts 'вверх\вниз'

